### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_alert_policy.alert will be created
  + resource "newrelic_alert_policy" "alert" {
      + account_id          = (known after apply)
      + id                  = (known after apply)
      + incident_preference = "PER_POLICY"
      + name                = "prod-snapshot-age-monitor alert policy"
    }

  # newrelic_notification_channel.slack-channel[0] will be created
  + resource "newrelic_notification_channel" "slack-channel" {
      + account_id     = (known after apply)
      + active         = true
      + destination_id = (sensitive value)
      + id             = (known after apply)
      + name           = "prod-snapshot-age-monitor slack"
      + product        = "IINT"
      + status         = (known after apply)
      + type           = "SLACK"

      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # newrelic_nrql_alert_condition.failing-snapshot-age will be created
  + resource "newrelic_nrql_alert_condition" "failing-snapshot-age" {
      + account_id                   = (known after apply)
      + aggregation_window           = 3600
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "prod-snapshot-age-monitor failing snapshot age"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200

      + critical {
          + operator              = "above_or_equals"
          + threshold             = 3
          + threshold_duration    = 3600
          + threshold_occurrences = "all"
        }

      + nrql {
          + query = "SELECT filter(count(*), WHERE result = 'FAILED') AS 'Failures' FROM SyntheticCheck WHERE monitorName = 'prod-snapshot-age-monitor'"
        }

      + warning {
          + operator              = "above_or_equals"
          + threshold             = 2
          + threshold_duration    = 3600
          + threshold_occurrences = "all"
        }
    }

  # newrelic_synthetics_script_monitor.snapshot-age-monitor will be created
  + resource "newrelic_synthetics_script_monitor" "snapshot-age-monitor" {
      + account_id           = (known after apply)
      + guid                 = (known after apply)
      + id                   = (known after apply)
      + locations_public     = [
          + "AP_SOUTHEAST_1",
          + "EU_CENTRAL_1",
          + "US_WEST_1",
        ]
      + name                 = "prod-snapshot-age-monitor"
      + period               = "EVERY_HOUR"
      + period_in_minutes    = (known after apply)
      + runtime_type         = "NODE_API"
      + runtime_type_version = "16.10"
      + script               = <<-EOT
            // eslint-disable-next-line @typescript-eslint/no-var-requires -- "approved" methods of resolving this lint do not work in the NR context.
            var assert = require("assert");
            
            function check_snapshot(url, genesisTime) {
              // eslint-disable-next-line @typescript-eslint/no-unused-vars -- that's how the callback works in this context.
              var callback = function (_err, response, _body) {
                assert.equal(response.statusCode, 200, "Expected a 200 OK response");
            
                var snapshotName = response.url.split("/").pop();
                var height = snapshotName.match(/height_(\d+)/)[1];
            
                var currentTime = Math.floor(Date.now() / 1000);
                var snapshotTime = height * 30 + genesisTime;
                var snapshotAgeInMinutes = (currentTime - snapshotTime) / 60;
            
                assert(
                  snapshotAgeInMinutes < 360,
                  "Expected snapshot to be less than 360 minutes old"
                );
              };
            
              // This variable is provided by New Relic.
              // eslint-disable-next-line no-undef
              $http.head(url, callback);
            }
            
            check_snapshot(
              "https://forest-archive.chainsafe.dev/latest/calibnet/",
              1667326380
            );
            check_snapshot(
              "https://forest-archive.chainsafe.dev/latest/mainnet/",
              1598306400
            );
        EOT
      + script_language      = "JAVASCRIPT"
      + status               = "ENABLED"
      + type                 = "SCRIPT_API"

      + tag {
          + key    = "service"
          + values = [
              + "forest-snapshot",
              + "prod",
            ]
        }
    }

  # newrelic_workflow.alerting-workflow-slack[0] will be created
  + resource "newrelic_workflow" "alerting-workflow-slack" {
      + account_id            = (known after apply)
      + destinations_enabled  = true
      + enabled               = true
      + enrichments_enabled   = true
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + last_run              = (known after apply)
      + muting_rules_handling = "NOTIFY_ALL_ISSUES"
      + name                  = "prod-snapshot-age-monitor slack alerting workflow"
      + workflow_id           = (known after apply)

      + destination {
          + channel_id            = (known after apply)
          + name                  = (known after apply)
          + notification_triggers = (known after apply)
          + type                  = (known after apply)
        }

      + issues_filter {
          + filter_id = (known after apply)
          + name      = "prod-snapshot-age-monitor alerting workflow filter"
          + type      = "FILTER"

          + predicate {
              + attribute = "labels.policyIds"
              + operator  = "EXACTLY_MATCHES"
              + values    = (known after apply)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/forest-iac/forest-iac/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/forest-iac/forest-iac/tfplan"
```

</details>